# Определение компилятора и опций компиляции
CC = cl
CFLAGS = /EHsc

# Имя исполняемого файла
TARGET = snake_game.exe

# Список исходных файлов
SRCS = main.cpp

# Генерация имен объектных файлов
OBJS = $(SRCS:.cpp=.obj)

# Цель для сборки всего проекта
all: $(TARGET)

# Цель для сборки исполняемого файла
$(TARGET): $(OBJS)
	$(CC) $(CFLAGS) /Fe$(TARGET) $(OBJS)

# Правило для компиляции .cpp файлов в .obj файлы
.cpp.obj:
	$(CC) $(CFLAGS) /c $<

# Цель для очистки созданных объектных файлов и исполняемого файла
clean:
	del $(OBJS) $(TARGET)
